wroscoe/dustycam/sensors/miclogger/sdkconfig.defaults
# Seeed XIAO ESP32S3 Sense: 8MB flash (DIO per factory bootloader — never
# force QIO, sarg lesson), 8MB octal (OPI) PSRAM, native USB-Serial-JTAG.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# OTA over plain HTTP on the LAN + rollback safety
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xc000

# OTA download overflows the 3.5KB default main stack (camlogger lesson)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288
CONFIG_MIC_SAMPLE_RATE=8000
